# Guided Project: Analyzing CIA Factbook Data Using SQL

You should see the output: 'Connected: None@factbook.db'

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

- Write a query to return information on the tables in the database.
- Write and run another query that returns the first 5 rows of the facts table in the database.

In [18]:
%%sql
select * from facts LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Write a single query that returns the:

- Minimum population
- Maximum population
- Minimum population growth
- Maximum population growth

In [19]:
%%sql
select 
MIN(population), 
MAX(population), 
MIN(population_growth), 
MAX(population_growth)
from facts

Done.

[(0, 7256490011, 0.0, 4.02)]

- Write a query that returns the countrie(s) with the minimum population.
- Write a query that returns the countrie(s) with the maximum population.

In [20]:
%%sql
select * FROM facts
where population == (select MIN(population) FROM facts)

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [21]:
%%sql
select * FROM facts
where population == (select MAX(population) FROM facts)

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

Calculate the average value for the following columns:

- population
- area

In [22]:
%%sql
select AVG(population) as avg_population, AVG(area) as avg_area
from facts #including 'world' row

Done.

[(62094928.32231405, 555093.546184739)]

In [26]:
%%sql
select AVG(population), AVG(area)
from facts
where name != 'World' #without 'world' row

Done.

[(32242666.56846473, 555093.546184739)]

Write a query that finds all countries meeting both of the following conditions:
- The population is above average.
- The area is below average.

In [13]:
%%sql
select name
from facts
where (population > (select AVG(population) from facts) AND area < (select AVG(area) from facts))

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

- Which countries have the highest ratios of water to land? Which countries have more water than land?
- Which countries will add the most people to their population next year?
- Which countries have a higher death rate than birth rate?

Below is the country that has the highest area water to land ratios

In [31]:
%%sql
select name, MAX(area_water / area_land) as ratio, area_land, area_water
from facts

Done.

[('British Indian Ocean Territory', 905, 60, 54340)]

Below is the country that has more water than land

In [32]:
%%sql
select name, area_land, area_water
from facts
where area_water > area_land

Done.

[('British Indian Ocean Territory', 60, 54340), ('Virgin Islands', 346, 1564)]

Below are the country that will add the most people to their population next year

In [34]:
%%sql
select name as Country, population_growth
from facts
order by population_growth desc
limit 10

Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24),
 ('Qatar', 3.07),
 ('Burkina Faso', 3.03),
 ('Mali', 2.98),
 ('Cook Islands', 2.95),
 ('Iraq', 2.93)]

Below are countries that have higher death rate than birth rate

In [35]:
%%sql
select name as Country, death_rate, birth_rate
from facts
where death_rate > birth_rate

Done.

[('Austria', 9.42, 9.41),
 ('Belarus', 13.36, 10.7),
 ('Bosnia and Herzegovina', 9.75, 8.87),
 ('Bulgaria', 14.44, 8.92),
 ('Croatia', 12.18, 9.45),
 ('Czech Republic', 10.34, 9.63),
 ('Estonia', 12.4, 10.51),
 ('Germany', 11.42, 8.47),
 ('Greece', 11.09, 8.66),
 ('Hungary', 12.73, 9.16),
 ('Italy', 10.19, 8.74),
 ('Japan', 9.51, 7.93),
 ('Latvia', 14.31, 10.0),
 ('Lithuania', 14.27, 10.1),
 ('Moldova', 12.59, 12.0),
 ('Monaco', 9.24, 6.65),
 ('Poland', 10.19, 9.74),
 ('Portugal', 11.02, 9.27),
 ('Romania', 11.9, 9.14),
 ('Russia', 13.69, 11.6),
 ('Serbia', 13.66, 9.08),
 ('Slovenia', 11.37, 8.42),
 ('Ukraine', 14.46, 10.72),
 ('Saint Pierre and Miquelon', 9.72, 7.42)]